Revit 2024 API
BendingDetailLevelOfDetail Enumeration
 Describes the level of detail in which the Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailLevelOfDetail
Visual Basic
Public Enumeration BendingDetailLevelOfDetail
Visual C++
public enum class BendingDetailLevelOfDetail
Members
Member name | Description
ByView |  The level detail is taken from the view.
Coarse |  Centerline representation of the Bending Detail.
Fine |  Ribbon representation of Bending Detail.
See Also
Autodesk.Revit.DB.Structure Namespace